## `Terraform test`
#### Terraform Format and Style : `success`
#### Terraform Initialization   : `success`
#### Terraform Validation       : `Success! The configuration is valid.

`
#### Terraform Plan             : `success`

<details><summary>Show Plan</summary>
```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.kakeibo_ecr_policy_document: Refreshing state...
data.aws_route53_zone.website_zone: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.kakeibo_s3_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "kakeibo_s3_policy_document"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "s3 external access policy"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.acm_cert will be created
  + resource "aws_acm_certificate" "acm_cert" {
      + arn                       = (known after apply)
      + domain_name               = "unipawn.jp"
      + domain_validation_options = [
          + {
              + domain_name           = "*.unipawn.jp"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "unipawn.jp"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.unipawn.jp",
        ]
      + tags                      = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-acm-certificate"
          + "Project"     = "kakeibo"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.acm_cert will be created
  + resource "aws_acm_certificate_validation" "acm_cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.kakeibo_cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "kakeibo_cloudfront_distribution" {
      + aliases                        = [
          + "www.unipawn.jp",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "www.unipawn.jp"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_200"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-cloudfront-distribution"
          + "Project"     = "kakeibo"
        }
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "s3-origin-www.unipawn.jp"
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string = false

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = "s3-origin-www.unipawn.jp"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.website will be created
  + resource "aws_cloudfront_origin_access_identity" "website" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "www.unipawn.jp"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_db_instance.kakeibo_rds_instance will be created
  + resource "aws_db_instance" "kakeibo_rds_instance" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = "ap-northeast-1a"
      + backup_retention_period               = 30
      + backup_window                         = "09:10-09:40"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "kakeibo-rds-subnet-group"
      + delete_automated_backups              = true
      + enabled_cloudwatch_logs_exports       = [
          + "error",
          + "general",
          + "slowquery",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "8.0.20"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "kakeibo-rds-instance"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.r5.large"
      + kms_key_id                            = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "mon:10:10-mon:10:40"
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + option_group_name                     = "kakeibo-rds-option-group"
      + parameter_group_name                  = "kakeibo-rds-parameter-group"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 3306
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-rds-instance"
          + "Project"     = "kakeibo"
        }
      + timezone                              = (known after apply)
      + username                              = "hryze"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_option_group.kakeibo_rds_option_group will be created
  + resource "aws_db_option_group" "kakeibo_rds_option_group" {
      + arn                      = (known after apply)
      + engine_name              = "mysql"
      + id                       = (known after apply)
      + major_engine_version     = "8.0"
      + name                     = "kakeibo-rds-option-group"
      + name_prefix              = (known after apply)
      + option_group_description = "Managed by Terraform"
      + tags                     = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-rds-option-group"
          + "Project"     = "kakeibo"
        }
    }

  # aws_db_parameter_group.kakeibo_rds_parameter_group will be created
  + resource "aws_db_parameter_group" "kakeibo_rds_parameter_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "mysql8.0"
      + id          = (known after apply)
      + name        = "kakeibo-rds-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-rds-parameter-group"
          + "Project"     = "kakeibo"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_client"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_connection"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_database"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_results"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "collation_connection"
          + value        = "utf8mb4_general_ci"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "collation_server"
          + value        = "utf8mb4_general_ci"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "general_log"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "long_query_time"
          + value        = "0.1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "slow_query_log"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "time_zone"
          + value        = "Asia/Tokyo"
        }
    }

  # aws_db_subnet_group.kakeibo_rds_subnet_group will be created
  + resource "aws_db_subnet_group" "kakeibo_rds_subnet_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "kakeibo-rds-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-rds-subnet-group"
          + "Project"     = "kakeibo"
        }
    }

  # aws_ecr_lifecycle_policy.kakeibo_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "kakeibo_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 30
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "kakeibo-ecr-repository"
    }

  # aws_ecr_repository.kakeibo_ecr_repository will be created
  + resource "aws_ecr_repository" "kakeibo_ecr_repository" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "kakeibo-ecr-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-ecr-repository"
          + "Project"     = "kakeibo"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.kakeibo_repository_policy will be created
  + resource "aws_ecr_repository_policy" "kakeibo_repository_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchDeleteImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Sid       = "ecr policy"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "kakeibo-ecr-repository"
    }

  # aws_eip.nat_gateway_eip[0] will be created
  + resource "aws_eip" "nat_gateway_eip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-nat-gateway-eip-ap-northeast-1a"
          + "Project"     = "kakeibo"
        }
      + vpc               = true
    }

  # aws_eip.nat_gateway_eip[1] will be created
  + resource "aws_eip" "nat_gateway_eip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-nat-gateway-eip-ap-northeast-1c"
          + "Project"     = "kakeibo"
        }
      + vpc               = true
    }

  # aws_eip.nat_gateway_eip[2] will be created
  + resource "aws_eip" "nat_gateway_eip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-nat-gateway-eip-ap-northeast-1d"
          + "Project"     = "kakeibo"
        }
      + vpc               = true
    }

  # aws_eks_cluster.kakeibo_eks_cluster will be created
  + resource "aws_eks_cluster" "kakeibo_eks_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "kakeibo-prod-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-eks-cluster"
          + "Project"     = "kakeibo"
        }
      + version               = "1.17"

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.kakeibo_eks_node_group will be created
  + resource "aws_eks_node_group" "kakeibo_eks_node_group" {
      + ami_type        = (known after apply)
      + arn             = (known after apply)
      + cluster_name    = "kakeibo-prod-cluster"
      + disk_size       = (known after apply)
      + id              = (known after apply)
      + instance_types  = [
          + "r5.xlarge",
        ]
      + node_group_name = "kakeibo-dev-node-group"
      + node_role_arn   = (known after apply)
      + release_version = (known after apply)
      + resources       = (known after apply)
      + status          = (known after apply)
      + subnet_ids      = (known after apply)
      + tags            = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-eks-node-group"
          + "Project"     = "kakeibo"
        }
      + version         = "1.17"

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 1
        }
    }

  # aws_elasticache_parameter_group.kakeibo_elasticache_parameter_group will be created
  + resource "aws_elasticache_parameter_group" "kakeibo_elasticache_parameter_group" {
      + description = "Managed by Terraform"
      + family      = "redis5.0"
      + id          = (known after apply)
      + name        = "kakeibo-elasticache-parameter-group"

      + parameter {
          + name  = "cluster-enabled"
          + value = "no"
        }
    }

  # aws_elasticache_replication_group.kakeibo_elasticache_replication_group will be created
  + resource "aws_elasticache_replication_group" "kakeibo_elasticache_replication_group" {
      + apply_immediately              = false
      + at_rest_encryption_enabled     = false
      + auto_minor_version_upgrade     = true
      + automatic_failover_enabled     = false
      + configuration_endpoint_address = (known after apply)
      + engine                         = "redis"
      + engine_version                 = "5.0.6"
      + id                             = (known after apply)
      + maintenance_window             = "mon:10:40-mon:11:40"
      + member_clusters                = (known after apply)
      + node_type                      = "cache.m5.large"
      + number_cache_clusters          = 1
      + parameter_group_name           = "kakeibo-elasticache-parameter-group"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + replication_group_description  = "kakeibo elasticache replication group"
      + replication_group_id           = "kakeibo-elasticache-replication-group"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "kakeibo-elasticache-subnet-group"
      + tags                           = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-elasticache-replication-group"
          + "Project"     = "kakeibo"
        }
      + transit_encryption_enabled     = false

      + cluster_mode {
          + num_node_groups         = (known after apply)
          + replicas_per_node_group = (known after apply)
        }
    }

  # aws_elasticache_subnet_group.kakeibo_elasticache_subnet_group will be created
  + resource "aws_elasticache_subnet_group" "kakeibo_elasticache_subnet_group" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "kakeibo-elasticache-subnet-group"
      + subnet_ids  = (known after apply)
    }

  # aws_iam_role.eks_master will be created
  + resource "aws_iam_role" "eks_master" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-master-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_node will be created
  + resource "aws_iam_role" "eks_node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecr_ro_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecr_ro_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-role"
    }

  # aws_iam_role_policy_attachment.eks_cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-master-role"
    }

  # aws_iam_role_policy_attachment.eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-role"
    }

  # aws_iam_role_policy_attachment.eks_service_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_service_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "eks-master-role"
    }

  # aws_iam_role_policy_attachment.eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-role"
    }

  # aws_internet_gateway.kakeibo_internet_gateway will be created
  + resource "aws_internet_gateway" "kakeibo_internet_gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-internet-gateway"
          + "Project"     = "kakeibo"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.kakeibo_nat_gateway[0] will be created
  + resource "aws_nat_gateway" "kakeibo_nat_gateway" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-nat-gateway-ap-northeast-1a"
          + "Project"     = "kakeibo"
        }
    }

  # aws_nat_gateway.kakeibo_nat_gateway[1] will be created
  + resource "aws_nat_gateway" "kakeibo_nat_gateway" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-nat-gateway-ap-northeast-1c"
          + "Project"     = "kakeibo"
        }
    }

  # aws_nat_gateway.kakeibo_nat_gateway[2] will be created
  + resource "aws_nat_gateway" "kakeibo_nat_gateway" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-nat-gateway-ap-northeast-1d"
          + "Project"     = "kakeibo"
        }
    }

  # aws_route53_record.cert_validation["*.unipawn.jp"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05835681WCQFY59DW2RR"
    }

  # aws_route53_record.cert_validation["unipawn.jp"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05835681WCQFY59DW2RR"
    }

  # aws_route53_record.website will be created
  + resource "aws_route53_record" "website" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.unipawn.jp"
      + type            = "A"
      + zone_id         = "Z05835681WCQFY59DW2RR"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route_table.kakeibo_private_route_table[0] will be created
  + resource "aws_route_table" "kakeibo_private_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = ""
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = (known after apply)
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-private-route-table-ap-northeast-1a"
          + "Project"     = "kakeibo"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.kakeibo_private_route_table[1] will be created
  + resource "aws_route_table" "kakeibo_private_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = ""
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = (known after apply)
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-private-route-table-ap-northeast-1c"
          + "Project"     = "kakeibo"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.kakeibo_private_route_table[2] will be created
  + resource "aws_route_table" "kakeibo_private_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = ""
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = (known after apply)
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-private-route-table-ap-northeast-1d"
          + "Project"     = "kakeibo"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.kakeibo_public_route_table will be created
  + resource "aws_route_table" "kakeibo_public_route_table" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-public-route-table"
          + "Project"     = "kakeibo"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.kakeibo_sb_rtb_private[0] will be created
  + resource "aws_route_table_association" "kakeibo_sb_rtb_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.kakeibo_sb_rtb_private[1] will be created
  + resource "aws_route_table_association" "kakeibo_sb_rtb_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.kakeibo_sb_rtb_private[2] will be created
  + resource "aws_route_table_association" "kakeibo_sb_rtb_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.kakeibo_sb_rtb_public[0] will be created
  + resource "aws_route_table_association" "kakeibo_sb_rtb_public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.kakeibo_sb_rtb_public[1] will be created
  + resource "aws_route_table_association" "kakeibo_sb_rtb_public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.kakeibo_sb_rtb_public[2] will be created
  + resource "aws_route_table_association" "kakeibo_sb_rtb_public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.kakeibo_s3 will be created
  + resource "aws_s3_bucket" "kakeibo_s3" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "kakeibo-front-web"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-s3"
          + "Project"     = "kakeibo"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "clean-up"

          + expiration {
              + expired_object_delete_marker = true
            }

          + noncurrent_version_expiration {
              + days = 365
            }

          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website {
          + error_document = "public/404.html"
          + index_document = "index.html"
        }
    }

  # aws_s3_bucket_policy.kakeibo_s3_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "kakeibo_s3_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.kakeibo_s3 will be created
  + resource "aws_s3_bucket_public_access_block" "kakeibo_s3" {
      + block_public_acls       = true
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = false
    }

  # aws_security_group.cluster_master_sg will be created
  + resource "aws_security_group" "cluster_master_sg" {
      + arn                    = (known after apply)
      + description            = "EKS cluster master security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "cluster-master-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"                                = "prod"
          + "Name"                                       = "eks-master-sg"
          + "Project"                                    = "kakeibo"
          + "kubernetes.io/cluster/kakeibo-prod-cluster" = "shared"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.kakeibo_private_subnets["private_subnet_1a"] will be created
  + resource "aws_subnet" "kakeibo_private_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                                = "prod"
          + "Name"                                       = "kakeibo-private-subnet-ap-northeast-1a"
          + "Project"                                    = "kakeibo"
          + "kubernetes.io/cluster/kakeibo-prod-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.kakeibo_private_subnets["private_subnet_1c"] will be created
  + resource "aws_subnet" "kakeibo_private_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.5.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                                = "prod"
          + "Name"                                       = "kakeibo-private-subnet-ap-northeast-1c"
          + "Project"                                    = "kakeibo"
          + "kubernetes.io/cluster/kakeibo-prod-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.kakeibo_private_subnets["private_subnet_1d"] will be created
  + resource "aws_subnet" "kakeibo_private_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.6.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                                = "prod"
          + "Name"                                       = "kakeibo-private-subnet-ap-northeast-1d"
          + "Project"                                    = "kakeibo"
          + "kubernetes.io/cluster/kakeibo-prod-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"            = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.kakeibo_public_subnets["public_subnet_1a"] will be created
  + resource "aws_subnet" "kakeibo_public_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                                = "prod"
          + "Name"                                       = "kakeibo-public-subnet-ap-northeast-1a"
          + "Project"                                    = "kakeibo"
          + "kubernetes.io/cluster/kakeibo-prod-cluster" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.kakeibo_public_subnets["public_subnet_1c"] will be created
  + resource "aws_subnet" "kakeibo_public_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                                = "prod"
          + "Name"                                       = "kakeibo-public-subnet-ap-northeast-1c"
          + "Project"                                    = "kakeibo"
          + "kubernetes.io/cluster/kakeibo-prod-cluster" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.kakeibo_public_subnets["public_subnet_1d"] will be created
  + resource "aws_subnet" "kakeibo_public_subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-1d"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment"                                = "prod"
          + "Name"                                       = "kakeibo-public-subnet-ap-northeast-1d"
          + "Project"                                    = "kakeibo"
          + "kubernetes.io/cluster/kakeibo-prod-cluster" = "shared"
          + "kubernetes.io/role/elb"                     = "1"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.kakeibo_vpc will be created
  + resource "aws_vpc" "kakeibo_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Environment" = "prod"
          + "Name"        = "kakeibo-vpc"
          + "Project"     = "kakeibo"
        }
    }

Plan: 54 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>

*Pusher: @paypay3, Action: `pull_request`, Workflow: `terraform`*